driver-tests/sapbc/SAPBCTests/SAPBCJbi/test/TestCaseSapFlightGetDetailOut/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:echo="http://j2ee.netbeans.org/wsdl/echo">
  <soapenv:Body>
    <echo:item>
      <echo:AirlineId>LH</echo:AirlineId>
      <echo:ConnectionID>0400</echo:ConnectionID>
      <echo:FlightDate>1995-02-28</echo:FlightDate>
    </echo:item>
  </soapenv:Body>
</soapenv:Envelope>